-- create database kyobo_practice;
-- 
-- create table book_writer_info(
-- 	bwi_seq	int	not null	auto_increment	primary key,
-- 	bwi_bi_seq	int	not null		,
-- 	bwi_ai_seq	int	not null		
-- );
-- create table book_translator_info (
-- 	bti_seq	int	not null	auto_increment	primary key,
-- 	bti_name	varchar(255)	not null		
-- );
-- 
-- create table member_info (
-- 	mi_seq	int	not null	auto_increment	primary key,
-- 	mi_id	varchar(20)	not null		,
-- 	mi_pwd	varchar(30)	not null		
-- );
-- create table review_info (
-- 	ri_seq	int	not null	auto_increment	primary key,
-- 	ri_date	datetime	not null	default now()	,
-- 	ri_content	text	not null	,	
-- 	ri_score	int	not null	,	
-- 	ri_mi_seq	int	not null	,	
-- 	ri_bi_seq	int	not null		
-- );
-- 
-- create table cover_image(
-- 	ci_seq	int	not null	auto_increment	primary key,
-- 	ci_path	text	not null		,
-- 	ci_bi_seq	int	not null	,
-- 	ci_uri	text	not null		
-- );
-- 
-- create table book_text_intro (
-- 	bti_seq	int	not null	auto_increment	primary key,
-- 	bti_bi_seq	int	not null		,
-- 	bti_intro	text	not null		
-- );
-- 
-- create table book_intro_image(
-- 	bii_seq	int	not null	auto_increment	primary key,
-- 	bii_bi_seq	int	not null	,
-- 	bii_image	varchar(255)	not null		,
-- 	bii_uri	text	not null		
-- );
-- 
-- create table author_info(
-- 	ai_seq	int	not null	auto_increment	primary key,
-- 	ai_name	varchar(255)	not null		
-- );
-- 
-- create table publisher_info(
-- 	pi_seq	int	not null	auto_increment	primary key,
-- 	pi_name	varchar(255)	not null		
-- );
-- 
-- create table book_info(
-- 	bi_seq	int	not null	auto_increment	primary key,
-- 	bi_title	varchar(255)	not null,		
-- 	bi_price	int	not null		    ,
-- 	bi_discount	double	not null		,
-- 	bi_delivery	varchar(30)	not null	,
-- 	bi_reg_dt	date	not null		,
-- 	bi_pi_seq	int	not null		    ,
-- 	bi_ti_seq	int	not null		    ,
-- 	bi_sales	int	null	default 0	
-- );

-- INSERT INTO kyobo_practice.member_info
-- (mi_id, mi_pwd)
-- VALUES
-- ('user001', '1234'),
-- ('user002', '1234'),
-- ('user003', '1234'),
-- ('user004', '1234'),
-- ('user005', '1234'),
-- ('user006', '1234'),
-- ('user007', '1234'),
-- ('user008', '1234'),
-- ('user009', '1234'),
-- ('user010', '1234');
-- 
-- 
-- INSERT INTO kyobo_practice.author_info
-- (ai_name)
-- VALUES('박진희');
-- 
-- INSERT INTO kyobo_practice.publisher_info
-- (pi_name)
-- VALUES('출판사');
-- 
-- INSERT INTO kyobo_practice.book_info
-- (bi_title, bi_price, bi_discount, bi_delivery, bi_reg_dt, bi_pi_seq, bi_ti_seq, bi_sales)
-- VALUES('책제목', 15000, 0.1, '10000원이상 무료배송', '2021-05-15', 1, null, 15000);
-- 
-- INSERT INTO kyobo_practice.book_writer_info
-- (bwi_bi_seq, bwi_ai_seq)
-- VALUES(1, 1);
-- 
-- INSERT INTO kyobo_practice.book_intro_image
-- (bii_bi_seq, bii_image)
-- VALUES(1, 'image.jpg');
-- 
-- INSERT INTO kyobo_practice.book_text_intro
-- (bti_bi_seq, bti_intro)
-- VALUES(1, '책소개글입니다.');
-- 
-- INSERT INTO kyobo_practice.cover_image
-- (ci_path, ci_bi_seq)
-- VALUES('cover1.jpg', 1);
-- 
-- 
-- INSERT INTO kyobo_practice.review_info
-- ( ri_content, ri_score, ri_mi_seq, ri_bi_seq)
-- VALUES
-- ('리뷰내용입니다2', 3, 1, 1),
-- ('리뷰내용입니다3', 2, 1, 1),
-- ('리뷰내용입니다4', 5, 1, 1),
-- ('리뷰내용입니다5', 4, 1, 1);
-- 
-- select  * from review_info ri ;
-- 
-- INSERT INTO kyobo_practice.author_info
-- (ai_name)
-- VALUES('낸시');
-- 
-- INSERT INTO kyobo_practice.book_translator_info
-- (bti_name)
-- VALUES('번역가');
-- 
-- INSERT INTO kyobo_practice.publisher_info
-- (pi_name)
-- VALUES('민음사');
-- 
-- INSERT INTO kyobo_practice.book_info
-- (bi_title, bi_price, bi_discount, bi_delivery, bi_reg_dt, bi_pi_seq, bi_ti_seq, bi_sales)
-- VALUES('안녕하세요', 16000, 0.15, '9000원이상 무료배송', '2019-08-03', 2, 1, 500);
-- 
-- INSERT INTO kyobo_practice.book_writer_info
-- (bwi_bi_seq, bwi_ai_seq)
-- VALUES(2, 3);
-- 
-- INSERT INTO kyobo_practice.book_intro_image
-- (bii_bi_seq, bii_image)
-- VALUES(2, 'imageintro.jpg');
-- 
-- INSERT INTO kyobo_practice.book_text_intro
-- (bti_bi_seq, bti_intro)
-- VALUES(2, '연습용책소개글입니다.');
-- 
-- INSERT INTO kyobo_practice.cover_image
-- (ci_path, ci_bi_seq)
-- VALUES('cover2.jpg', 2);
-- 
-- INSERT INTO kyobo_practice.review_info
-- ( ri_content, ri_score, ri_mi_seq, ri_bi_seq)
-- VALUES
-- -- ('리뷰내용입니다2', 3, 2, 2),
-- -- ('리뷰내용입니다3', 5, 4, 2),
-- -- ('리뷰내용입니다4', 4, 8, 2),
-- ('리뷰내용입니다5', 5, 10, 2);
-- 
-- select * from book_writer_info a join author_info b on a.bwi_ai_seq = b.ai_seq ;
-- 

SELECT 
	TRUNCATE(bi_price*(1-bi_discount),-3) as discount_price
	,TRUNCATE(bi_price*(1-bi_discount)*0.05,-1) as 'point'
from book_info bi ;

-- -- 책 상세정보 페이지(책 정보) - 뷰 생성
-- CREATE or replace view book_detail_view as
select  a.bi_seq ,a.bi_title ,a.bi_price ,concat(a.bi_discount *100,'%') as bi_discount,a.bi_delivery 
	,a.bi_reg_dt ,a.bi_pi_seq ,a.bi_ti_seq ,a.bi_sales 
	, b.bti_intro, c.bii_image, c.bii_uri , d.bti_name, e.ai_name, round(f.score,2) as score
	,TRUNCATE(a.bi_price*(1-a.bi_discount),-3) as discount_price
	,TRUNCATE(a.bi_price*(1-a.bi_discount)*0.05,-1) as 'point' , f.review_count, g.ci_path , g.ci_uri , j.pi_name  
	,rank() over(ORDER BY a.bi_sales desc) as ranking
from book_info a 
left outer join book_text_intro b on b.bti_bi_seq = a.bi_seq 
left outer join book_intro_image c on c.bii_bi_seq =a.bi_seq 
left outer join book_translator_info d on a.bi_ti_seq = d.bti_seq 
join (
select h.bwi_bi_seq, group_concat(ai_name) as ai_name  from book_writer_info h join author_info i on h.bwi_ai_seq = i.ai_seq
group by h.bwi_bi_seq
) e on e.bwi_bi_seq = a.bi_seq 
left outer join (
select avg(ri_score)*2 as score, count(*) as review_count, ri_bi_seq  from review_info 
group by ri_bi_seq
) f on f.ri_bi_seq = a.bi_seq
join cover_image g on g.ci_bi_seq = a.bi_seq 
join publisher_info j on j.pi_seq = a.bi_pi_seq ;
-- where a.bi_seq = 1;
-- -- 책 상세정보 페이지(리뷰 전체 출력)
-- create or REPLACE view review_info_view as
select a.*, REGEXP_REPLACE(b.mi_id, '(?<=.{2}).', '*') as mi_id
from review_info a
join member_info b on a.ri_mi_seq =b.mi_seq
order by ri_bi_seq ;
--  -- offset은 (1*page)-1 로 연산하면 될거같음!!

SELECT * from book_writer_info bwi;

SELECT * from publisher_info pi3 ;
SELECT  bwi_ai_seq  from book_writer_info a;
-- 
-- create or replace 'auth/er_info_view' as 
-- select * from book_writer_info a join author_info b on a.bwi_ai_seq = b.ai_seq;
-- 
-- -- delete from author_info where ai_seq >4;
-- 
select * from publisher_info pi2 ;
select  * from book_translator_info bti ;
select * from book_info bi ;
select  * from review_info ri ;
select  * from cover_image ci ;
select * from book_writer_info bwi ;
select * from author_info ai ;
SELECT * from book_text_intro bti ;
SELECT * from book_intro_image bii where bii_uri ='개발자설명';
SELECT * from book_intro_image bii ;
SELECT count(*) as count , ci_uri  from book_detail_view bdv GROUP BY ci_uri HAVING count>1;
SELECT count(*) as count , bii_uri from book_detail_view bdv GROUP BY bii_uri HAVING count>1;
SELECT * from book_detail_view bdv where ci_uri ='한권컴표지' ;
 -- 23 24 점프 투 파이썬 104 

SELECT * from book_detail_view bdv ;

-- UPDATE review_info set ri_score=5 where ri_score >5;
-- 개발자 표지, 한권컴표지 
-- 24 점프투파이썬, 34  윤성우의 열혈 c프로드래밍

-- SELECT a.bi_seq , a.bi_sales , rank() over(order by a.bi_sales desc) as ranking from book_info a;

-- DELETE from book_info where bi_seq>31;
-- 
-- -- 책 리스트
-- -- create view book_list as
-- select  a.bi_seq ,a.bi_title ,a.bi_price ,a.bi_discount ,a.bi_reg_dt,
-- 	b.bti_intro, c.bii_image, d.bti_name, e.ai_name,f.score, a.bi_price*(1-a.bi_discount) as discount_price,
-- 	a.bi_price*(1-a.bi_discount)*0.05 as point , f.review_count, g.ci_path , a.bi_sales 
-- from book_info a 
-- join book_text_intro b on b.bti_bi_seq = a.bi_seq 
-- join book_intro_image c on c.bii_bi_seq =a.bi_seq 
-- left outer join book_translator_info d on a.bi_ti_seq = d.bti_seq 
-- join (
-- select * from book_writer_info a join author_info b on a.bwi_ai_seq = b.ai_seq
-- ) e on e.bwi_bi_seq = a.bi_seq 
-- join (
-- select avg(ri_score) as score, count(*) as review_count, ri_bi_seq  from review_info 
-- group by ri_bi_seq
-- ) f on f.ri_bi_seq = a.bi_seq
-- join cover_image g on g.ci_bi_seq = a.bi_seq
-- order by a.bi_sales desc;
-- 
-- desc book_detail_view ;
-- 
-- 
-- select * from book_writer_info bwi ;
-- 
-- select h.bwi_bi_seq, group_concat(ai_name)  from book_writer_info h join author_info i on h.bwi_ai_seq = i.ai_seq
-- group by h.bwi_bi_seq;
-- 
-- select * from member_info mi;

-- insert into cover_image (ci_path, ci_bi_seq)
-- values
-- ('cover3.jpg',3);

-- UPDATE kyobo_db.book_info SET bi_pi_seq= bi_pi_seq+15; 

SELECT *
FROM kyobo_db.book_detail_view;
SELECT * FROM review_info ri ;
SELECT * FROM  cover_image ci ;
SELECT * FROM book_intro_image bii ;
INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022-12-19', '전에 구매했던 엑셀책하고는 많이 다르네요.정말 실무에 도움이 되는 내용 즉 퇴근시간이 빨라질수 있는 내용으로 가득차네요....', 4, 1, 2),
('2022-12-18', '유투브로 먼저 강의보고 책 구매했어요', 4, 2, 2),
('2022-12-15', '모르는거 찾아보는 용도로 도움돼요', 4, 3, 2),
('2022-12-14', '기초부터 응용까지 좋은교재입니다.', 4, 4, 2),
('2022-12-10', '선물용으로 샀는데 쉽게 쓰여있어서 좋다고합니다.', 4, 5, 2),
('2022-12-05', '좋아요~~도움되요ㅎㅎ', 4, 6, 2),
('2022-12-04', '알기쉽게 셜명되어있어 독학하기 좋습니다.', 4, 7, 2),
('2022-12-02', '집중적으로...엑셀을 활용할 수 있도록 도움을 줍니다', 4, 8, 2),
('2022-11-30', '업무에 도움이되는 많은 정보들이 있어 좋아요', 4, 9, 2),
('2022,11-28', '실무에 도움이 됩니다', 4, 10, 2),
('2022,11-26', '쉽고 빠르게 이해되네요', 4, 11, 2),
('2022,11-25', '이해가 잘되고 쉬워요', 4, 12, 2),
('2022,11-25', '쉽고 이해가 잘되네요', 4, 13, 2),
('2022,11-25', '쉽고 좋습니다 강추', 4, 14, 2),
('2022,11-24', '다른 엑셀책보다 더 실무용으로 적합하고 동영상 강의도 좋아 추천합니다', 4, 15, 2),
('2022,11-19', '알자 책 내용이 너무 방대하네요', 4, 16, 2),
('2022,11-17', '책을통해소중한경험을하고배웁니다.', 4, 17, 2),
('2022,11-17', '내가볼려고 산건데 동생이 공부한다고 가져가버렸네요~재구매예정입니다~', 4, 18, 2),
('2022-11-04', '저자가 워낙 엑셀에 실력있는 분이시라 고급팁들이 많습니다. 하지만 기초부터 차근차근 설명하지 않고 난이도있는 함수가 갑자기 튀어나오곤 하기 때문에 엑셀 초보자에겐 조금 어렵습니다. 그리고 어떤 경우엔 팁에 대한 제목만 있고 QR코드를 연결하여 영상 강의로 해결해야하는 경우도 있습니다. 이런 경우는 조금 불편합니다. 간단하게 순서만 적어놓더라도 책에 해당 내용이 있었으면 좋았을 것 같습니다.', 4, 19, 2),
('2022-10-21', '유튜브 오빠두엑셀을 단편적이나마
많은 도움이 되어 구매하게 되었습니다', 4, 20, 2),
('2022-10-21', '읽기 아주 좋아요 잙읽혀요', 4, 21, 2),
('2022-10-20', '실질적으로 필요한 내용들이 가득가득', 4, 22, 2),
('2022-11-06', '감사 합니다. 잘 읽겠습니다.', 4, 23, 2),
('2022-10-31', '배송도 빠르고 도움도 되네요 !', 4, 24, 2),
('2022-10-30', '실무에 정말 많은 도움이 돼요', 4, 25, 2),
('2022-10-28', '실무에 필요한 것만 쓰여 있네요', 4, 26, 2),
('2022-10-25', '직장생활 14년차 매번 새해 다짐으로 엑셀 한번 끝내보겠다고 한게 어언 10년이 다되갑니다..
회사 처음 입사했을 때 배운 스킬 그대로 부서에서 쓰는 서식 그대로 발전없이 사용하고 있던 찰나 주변 지인 추천으로 구매했는데 매우 만족스럽습니다.
저자분 블로그에 교재 페이지마다 영상이 있어서 진도도 수월하게 나갈 수 있고 공부하기 좋은 것 같습니다
제게 엑셀 자신감을 심어준 첫 책입니다 감사합니다', 3, 27, 2),
('2022-10-19', '이책 절대 사지마세요 평이 좋아 샀지만 내용이 예제에 맟춘 설명이라기 보담 너무 포괄적이라 따라하기 부담스러운책 입니다
그러나 내용을 많이 담으려다보니 하나하나 세세한 설명은 충실하지 않은거 같습니다 한마디로 내용이 눈에 들오오지 않는 산만한 책 입니다

클로버 세개도 아깝습니다

추천 절대 안합니다', 4, 28, 2),
('2022-10-16', '실제 실무에서 쓰는 것과 컴활 시험에서 쓰는 엑셀의 차이를 알 수 있었어요.', 4, 29, 2),
('2022-10-11', '감사 합니다. 잘 읽겠습니다.', 4, 30, 2)
;

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.08.26', '좋아요 쉬운 설명으로 이해가 쉽습니다.', 4, 1, 7),
('2022.08.27', '책이 쉽고 깔끔해서 좋네요', 4, 2, 7),
('2022.09.01', '고심해서 골랐는데 만족합니다.', 4, 3, 7),
('2022.09.09', '혼자 공부하는 파이션 차근 차근 공부해 봐요', 4, 4, 7),
('2022.11.05', '유익한 내용이 많아요~', 4, 5, 7),
('2022.11.18', '잘 읽어보겠습니다. 기대되네요 어떤 내용인지', 4, 6, 7),
('2022.11.30', '한번 보려고 샀어료', 3, 7, 7),
('2022.12.01', '업무에 활용할 수 있는 좋은 책 입니다.', 4, 8, 7),
('2022.12.02', '좋은책 감사합니다!+~~', 4, 9, 7),
('2022.12.08', '빅데이터 분석에 도움될거라 기대합니다', 4, 10, 7),
('2022.06.10', '한번쯤은 읽어보면 좋을듯 합니다.', 4, 11, 7),
('2022.06.11', '혼자 공부하려고 구매..파이썬 시작...', 4, 12, 7),
('2022.06.11', '파이썬을 혼자 공부할수 있도록 만든 책이네요.', 4, 13, 7),
('2022.06.15', '유용합니다 잘 보았습니다', 4, 14, 7),
('2022.07.15', '좋아요 잘읽히네요 :)', 4, 15, 7),
('2022.07.29', '혼자 공부하려고 샀는데 이해하기 쉽고 알기 쉽게 설명이 되어있어서 재미있고 즐겁게 공부할 수 있을 것 같아요. 잘 샀어요.', 4, 16, 7),
('2022.08.17', '아이가 공부하고 싶어해서 샀네요. 쉽고 볼만합니다.', 4, 17, 7),
('2022.08.22', '파이썬 입문서 몇권 사봤는데. 이게 가장 상세하고 초보자들이 쉽게 이해할수 있게 잘쓰여진 책인듯.', 4, 18, 7),
('2022.06.20', '유용합니다 잘 보았습니다', 3, 19, 7),
('2022.06.25', '파이썬 시작부터 응용까지 한큐에 볼 수 있다. 혼공파가 유명한 이유가 있다!', 4, 20, 7),
('2022.07.24', '파이썬 초보자도 쉽게 공부할수 있습니다', 4, 21, 7),
('2022.07.03', '이 책은 단순한 코딩 교재가 아닌 것 같습니다. 저자에게 과외를 받는 듯한 느낌을 받을 정도로 꼼꼼하고 친절하게 구성되어 있기 때문입니다. 특히 저자는 중간중간 자신의 경험을 언급하며 독자가 코딩에 흥미를 잃지 않도록 많이 배려해 줍니다. 이런 부분을 읽으며 “역시 코딩에는 왕도가 없구나, 이 저자도 나와 비슷한 생각을 하며 묵묵히 파이썬을 정복해왔구나” 하는 생각이 들었습니다.', 4, 22, 7),
('2022.08.22', '파이선의 기본서중에 정말 시작하기 좋고 쉽게 쉽게 잘 구성된 책입니다.
이번에 개정판이 나와서 조금더 최신 문법 적용 및 구성이 더 좋아진거 같습니다.
처음 하실때 해당 책을 기반으로 저자분이 동영상 강의도 있으니
좋은 가이드가 되는 책입니다.', 4, 23, 7),
('2022.10.16', '내용이 풍부하고 이해하기 쉬어요', 4, 24, 7),
('2022.06.28', '저는 현재 데이터분석가를 준비하는 취업준비생입니다. 여러 자격증을 획득한 가운데 실습능력이 부족하여 파이썬을 배우려고 이 책을 선택하였습니다. 
먼저 이 책은 총 8개의 챕터로 나누어 공부할 수 있도록 잘 설계되어 있습니다. 먼저 기본 개념을 설명해준 뒤에 학습자가 코드를 보고 따라할 수 있도록 잘 설명되어져 있습니다. 특히 파이썬을 처음 배우신 분이나 초보자에게 강력히 추천 드립니다', 4, 25, 7)
;

-- update review_info set ri_score=4 where ri_score=10;
-- 19
-- INSERT into author_info (ai_name)
-- values('한진만');

-- INSERT INTO kyobo_db.book_writer_info
-- (bwi_bi_seq, bwi_ai_seq)
-- VALUES(19, 21);


INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.20', '다양한 문제가 있어서 좋았어요!', 4, 1, 20),
('2022.12.12', '좋은 책입니다. 열심히 공부할게요', 4, 2, 20),
('2022.12.16', '2023년도에는 해커스 전산회계 1급이론+실무+최신기출문제 기본서로 한방에 합격하고 싶습니다!', 4, 3, 20),
('2022.12.18', '한번에 끝! 핵심이론과 풍부한 기출문제로 전산회계 1급 시험을 완벽하게 대비 단기 합격가능', 4, 4, 20),
('2022.12.18', '전산회계 1급 공부를 하는데 많은 도움이 되었습니다. 모르는 부분들도 기출 문제를 통해 배울 수 있어서 유익했습니다.', 4, 5, 20),
('2022.12.19', '해커스 전산회계 1급으로 합격하고 취뽀까지!!', 4, 6, 20),
('2022.12.19', '전산회계를 따기위해 책 선택의 고민이 생겨 여기저기 알아보다가 이 책으로 정착했습니다 ~ 구성이 좋네유', 4, 7, 20),
('2022.12.19', '전산회계 1급 꼭 합격하고싶어요 취업까지 꼬우꼬우~', 4, 8, 20),
('2022.12.20', '핵심이론과 기출문제가 한권으로 구성되어있습니다', 4, 9, 20),
('2022.12.20', '전산회계 1급 이론+실무+최신기출문제 구성이 알찬 교재입니다', 4, 10, 20)
;

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2021.03.11', '교재용 서적 잘 사용하겠습니다.', 4, 1, 24),
('2021.03.13', '내용이 잘 구성되있는거 같아요 탐독하겠습니다!', 4, 2, 24),
('2021.03.16', '도움이 많이 됩니다.', 4, 3, 24),
('2021.03.19', '대학교재대학교재 대학교재', 4, 4, 24),
('2021.03.27', '비전공자이지만 이해하기 쉬운 좋은 입문서같습니다. 도움 많이 되었습니다.', 4, 5, 24),
('2021.04.05', '쉽게 배울 수 있어요.', 4, 6, 24),
('2021.04.11', '책 보면서 따라하다 보니 전반적인 파이썬 기초에 대해 알게 되었어요', 3, 7, 24),
('2021.06.08', '파이썬 독학에 좋습니다.', 4, 8, 24),
('2021.06.13', '괜히 1등이 아니다.', 4, 9, 24),
('2021.07.14', '열심히 공부해보겠습니다. 화이팅', 4, 10, 24),
('2022.01.07', '어려워요. 초급자들은 더 쉬운 책 찾아보세요', 4, 11, 24),
('2022.01.19', '아이가 필요하다해서 구입했어요', 4, 12, 24),
('2022.02.06', '많은 공부가 되고 있습니다.', 4, 13, 24),
('2022.02.20', '쉽게 파이썬을 접해볼 수 있다는 것에 의의를 둘 수 있는 책이에요.', 4, 14, 24),
('2022.03.12', '쉽게 공부하기 좋습니다 :)', 4, 15, 24),
('2022.03.14', '파이썬을 기초부터 차근차근 공부할 수 있어서 좋은 것 같아요.', 4, 16, 24),
('2022.03.15', '좋습니다 또 구입해야겠다는 생각이 듭니다 만들어주신 모든 분들께 감사드립니다', 4, 17, 24),
('2022.03.18', '좋아요 잘 보겠습니다', 3, 18, 24),
('2022.03.26', '전반적인 내용이 유용합니다.', 4, 19, 24),
('2022.04.02', '아들이 독학한다고 ㅋㅋ 주문했네요.', 4, 20, 24),
('2022.07.03', '좋아요', 4, 21, 24),
('2019.07.20', '그냥 그럼 왜 베스트셀러인지...', 1, 22, 24),
('2019.07.11', '하나하나 설명이 좋습니다.공대다니면서 했던 간단한 프로그래밍 수준을 아는 분들한테는 더욱 좋습니다.', 4, 23, 24),
('2019.11.05', '읽기 정말 쉽게 되어있음', 4, 24, 24),
('2019.10.06', '원래 다른책 도서관에서 빌려보다 인기 많아서 샀는데 인기가 많은 이유가 있음', 4, 25, 24),
('2019.10.02', '기술 입문용 구입', 4, 26, 24),
('2019.09.17', '커뮤니티사이트도 있어서 좋아요', 4, 27, 24),
('2019.08.16', '처음 배우는 분들에게 좋을듯 합니다', 4, 28, 24),
('2019.08.10', '쉽지만은 않지만 그래도 깔끔합니다', 4, 29, 24),
('2019.07.16', '추천받아 구매했는데.... 열공!!!!', 4, 30, 24)
;

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.15', '인사이트가 있는 책입니다.', 4, 1, 27),
('2022.12.05', '인사이트가 있는 책입니다. 추천합니다', 4, 2, 27),
('2022.11.27', '비전공자라 이해하기 힘든 용어들을 알 수 있어 좋아요', 4, 3, 27),
('2022.11.18', '많은 도움이 되는 도서이며, 배송은 말할것도 없이 깔끔하고 빠르게 진행되었습니다. 포인트 등 교보문고에서 구입하는 만족감이 큽니다.', 4, 4, 27),
('2022.11.10', '예시를 통한 지식 전달 방식이 이해도를 높였음', 4, 5, 27),
('2022.10.31', '배송도 빠르고 도움도 되네요 !', 4, 6, 27),
('2022.10.25', '비전공자를 위해 이해할 수 있게 쉽게 정리되어 있어요.', 4, 7, 27),
('2022.10.25', '공부하려고 구매..', 4, 8, 27),
('2022.10.24', '딱 IT업계에 관련된 업계의 사람들이 공통적으로 알고있기 좋은 내용들입니다', 4, 9, 27),
('2022.10.23', '업무에 필요해서 구매했어요 잘 읽히고 이해가 잘 되요', 4, 10, 27),
('2021.11.06', '비전공자입니다. 책 내용은 매우 좋습니다. 그러나 가격에 비해 내용이 적다는 생각이 큽니다.', 4, 11, 27),
('2021.12.30', '비전공자로 소프트업계와 일하게되어 유트브로 공부하다가 알게되어 읽었습니다. 쉽게 설명되어 있어요 진짜 비전공자를 위한 책입니다', 4, 12, 27),
('2021.12.26', '제목답게 IT에 대해서 전혀 모르는 사람도 이해할 수 있고 어려운 IT용어를 쉽게 설명해주셔서 왠지모를 자신감이 생기는 기분이 듭니다', 4, 13, 27),
('2021.12.17', '천천히 읽고 있어요.', 4, 14, 27),
('2021.12.05', '도움되고 좋습니다!', 4, 15, 27),
('2021.12.02', '잘 읽었습니다 내용 괜찮네요.', 4, 16, 27),
('2021.11.25', '실무보다는 IT 분야의 기본이론같은 서적. 원리가 궁금하고 전반적인 이해가 하고 싶을 때 읽으면 좋은 책.', 4, 17, 27),
('2021.11.21', '공부하려고 샀습니다. 기대됩니다.', 4, 18, 27),
('2021.11.09', 'IT 지식에 대해 궁금한 점이 많았는데, 도움이 되었다..!', 4, 19, 27),
('2021.10.31', '큰 틀을 잡는데 유용한 책입니다 :)', 4, 20, 27),
('2021.08.11', '좋아요 좋아요 좋아요', 4, 21, 27),
('2021.08.08', '이분야가 쉬운분야는 아니지만 정독하는데 괜찮아 보이는 책입니다.', 4, 22, 27),
('2021.08.03', '비전공자 실무자가 IT를 한 번 맛보기에 좋습니다.', 3, 23, 27),
('2021.08.03', 'IT에 대해 아무것도 몰라서 이해차원에서 구입했어요. 아주 명쾌하게 이해는 안 가지만 그래도 얼추 이런거구나~ 알 수 있었어요. 한번 더 읽어야 저는 이해할 것 같아요! 비전공자를 위해 이런 책이 있어서 좋네요', 4, 24, 27),
('2021.07.21', '비 전공자도 IT지식을 이해하는데 큰 도움이 됩니다', 4, 25, 27),
('2021.07.14', '차라리 블로그 티스토리에서 찾아보는게 더 유익할듯 합니다', 1, 26, 27),
('2021.07.14', '열심히 공부해보겠습니다~', 4, 27, 27),
('2021.07.09', '이렇게 읽기 쉬운 책이 있었다니...깊은 지식을 습득하려하기 전에 꼭 한번 이 책을 읽어 전반적인 개념과 구조를 명확히 할 수 있게 되기를 바랍니다.', 4, 28, 27),
('2021.06.02', '아이가 좋아하는 책이예요', 4, 29, 27),
('2021.05.19', '비전공자+실무자인데 재밌게 읽었습니다.', 4, 30,27)
;

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.05', '정보처리기사 준비에 잘 활용하겠습니다.', 4, 1, 31);
INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.05', '잘 받았고 잘 읽어보겠습니다', 4, 1, 29),
('2022.11.14', '정말 좋은 책입니다. 한 번 구매해서 읽어보시는 것을 추천드립니다.', 4, 2, 29),
('2022.11.04', '업무 향상이 느껴집니다', 4, 3, 29),
('2022.10.06', '클린코드는 개발자라면 읽어봐야할 책', 4, 4, 29),
('2022.07.21', '추천 받아서 구매했습니다. 정독할게요', 4, 5, 29),
('2022.07.20', 'clean architecture책에 이어 사봤는데 워낙 유명한 책인 만큼 이름 값을 합니다.', 4, 6, 29),
('2022.06.25', '책이 아주 좋습니다.', 4, 7, 29),
('2022.05.28', '개발자라면 필독도서 입니다~', 4, 8, 29),
('2022.04.26', '추천해서 봤어요 좋아요', 4, 9, 29),
('2022.04.22', '잘읽어볼게요...', 4, 10, 29),
('2021.06.15', '프로그램 개발하는데 유용해요~', 4, 11, 29),
('2021.05.07', '깨끗한 코드를 작성하는 방법은 배우기 어렵다. 단순히 원칙과 패턴을 안다고 깨끗한 코드가 나오지 않는다. 고생을 해야 한다. 스스로 연습하고 실패도 맛봐야한다.', 4, 12, 29),
('2021.05.03', '유용해요 추천합니다', 4, 13, 29),
('2021.02.16', '성장하고자 하는 개발자라면...', 4, 14, 29),
('2020.11.15', '개발자들의 필수책', 4, 15, 29),
('2020.08.05', '이해가 쏙쏙 갑니다.', 4, 16, 29),
('2020.07.25', '자바 개발자는 아니지만 좋은코드를 작성하는 방식에 대해 알 수 있어 좋습니다', 4, 17, 29),
('2020.06.13', '좋은 내용이 많습니다. 예제 코드는 99% JAVA인 것을 사기 전에 꼭 짚고 넘어가냐 합니다', 4, 18, 29),
('2020.05.20', '조금은 레벨업 하고 싶다면,', 4, 19, 29),
('2020.05.14', '좋아요', 4, 20, 29),
('2019.02.09', '이 책을 읽으면 실력이 늘어난다거나 기발한 방법이 떠오르는게 아니라 그동안 자신의 코딩이 얼마나 부족했는지...(흔한말로 개판으로 짠 코딩인지)를 알게된다. 또한 가볍게 읽는다고 해서 클린~하게 코드를 짤 수 있게 되는것도 아니다. 한번 읽고 나면 마음은 앞서가지만 실제로 책의 내용을 코드에 반영하기란 쉽지 않다는걸 또 다시 깨닫게된다. 열심히 읽고 또 읽고 분석해야 겨우 이해하고 적용할 수 있는 어려운 책이란 것도 구입전에 알고 계시길 바란다', 4, 21, 29),
('2019.11.01', '프로그래밍에 대한 생각을 한번 더 하게 해주어서 감사합니다.', 4, 22, 29),
('2019.10.31', '정리가 잘 되어있어요', 4, 23, 29),
('2019.10.22', '내용이 정말 좋네요', 4, 24, 29),
('2019.09.05', '다들 추천해줘서 샀는데 좋응거 같아요 잘 읽히고 어렵지 않아서 좋네요 잘산거 같아요', 4, 25, 29),
('2019.08.29', '잘산것같네요. 입문자들은 한번쯤 정독할만한 책인것 같아요.', 4, 26, 29),
('2019.07.29', '좋습니다. 감사합니다.', 4, 27, 29),
('2019.06.15', '필요해서 샀습니다.', 4, 28, 29),
('2019.05.24', '그돔안의 문제점을 정리해주어서 좋았습니다.', 4, 29, 29),
('2019.01.02', '프로그래머 필독서', 4, 30, 29) 
;

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.08', '교육 때문에 샀는데 잘 봤습니다!', 4, 1, 33),
('2022.11.19', '해설만 보강되면 좋은 것 같습니다.', 4, 2, 33),
('2022.11.08', 'adsp 자격증 공부에 많은 도움이 되었어요', 4, 3, 33),
('2022.11.07', '비전공자도 보다 쉽게 공부할 수 있었어요', 4, 4, 33),
('2022.11.04', '새로 나온 책은 오류도 없어서 공부하기 좋았어요', 4, 5, 33),
('2022.11.02', '시험에서 출제되는 문제가 많았습니다', 4, 6, 33),
('2022.10.29', '공부하기 좋아요 추천합니다', 4, 7, 33),
('2022.10.17', '유명한 민트 책이죠', 4, 8, 33),
('2022.10.16', '자격증 공부하려고 샀습니다', 4, 9, 33),
('2022.10.08', '아직 보기 전이지만 한번에 붙고싶어요', 4, 10, 33),
('2022.08.15', '솔직히 잘 모르겠어요. 많이 읽는다니 그냥 샀러요', 4, 11, 33),
('2022.08.11', '시험에 꼭 붙었으면 좋겠어요....화이팅!!!!', 4, 12, 33),
('2022.07.27', '이 책 보고 자격증 합격 했습니다!!', 4, 13, 33),
('2022.07.25', '도움되는책이에요 한번에 합격할께요', 4, 14, 33),
('2022.06.27', '데이터 분석 준전문가 과정을 준비하면서 어떤 도서로 할까 했는데 이 책을 선택하고 후회가 없습니다.', 4, 15, 33),
('2022.06.21', '도움이 됩니다 가ㅁ사합니다ㅗㅇ', 4, 16, 33),
('2022.06.15', '기출정리잘되어있고오탈자는홈페이지에서회원가입후확인가능합니다', 4, 17, 33),
('2022.05.24', 'adsp시험 보는데 이책 한권이면 충분한거 같아요! :D', 4, 18, 33),
('2022.05.24', '잘 읽히고 정리가 잘 되어있어요', 4, 19, 33),
('2022.05.23', '기출문제 정리가 깔끔해서 좋았습니다.', 4, 20, 33),
('2022.08.16', '책 리뷰는 처음 남겨봅니다만, 저자와 출판사는 반성하셔야 할 것 같습니다.
우선 책 내용이 너무 빈약해서 뒤에 기출 문제 풀다가 당황했네요 최소한 기출 문제를 실으려면 관련된 이론들은 알려주고 실어야 하는 것 아닌가요. 문제 해설도 빈약한 것은 마찬가지 입니다.
심지어 오타나 문제 오류 등이 공부 시작한 첫 날부터 눈에 들어옵니다..
이 책이 많은 선택을 받았던 이유는 대체재가 없었기 때문인 것 같네요.', 1, 21, 33),
('2022.10.04', '열심히 공부해보겠습니다', 4, 22, 33),
('2022.09.16', '한 번 읽고 합격 끄아앙', 4, 23, 33),
('2022.09.13', '정독하고가면 시험합격 문제없습니다', 4, 24, 33),
('2022.09.12', '다른 책 보셔도 무방합니다. 꼭 이 책을 보실 필요는 없다고 생각합니다. 요즘 좋은 책 많이 나와 있습니다.', 3, 25, 33),
('2022.09.05', '다른책은 본적없어서 비교할 순 없지만 내용이 빈약하긴해도 뒤에 기출만으로 시험은 커버 가능합니다. 오탈자 얘기가 많은데 딱히 눈에 거슬리는 것 저는 없었네요.', 4, 26, 33),
('2022.09.01', '공부하는데 도움 많이 받았습니다!', 4, 27, 33),
('2022.08.29', '이 책 읽고 합격했어요!ㅎㅎ', 1, 28, 33),
('2022.08.29', '데이터분석준전문가 시험 준비하면서 민트책이라는 이 책이 가장 유명해서 이걸로 공부했어요. 해설이나 문제에 간혹가다 오타나 잘못 쓰여진게 있지만 그냥 눈치껏 해석하고 넘어갔어요~ 이론-문제-모의고사-기출 이런 식으로 있어서 시험 전부터 미리 계획 세워서 하면 공부 잘 될것같아요! 저는 벼락치기로 해서 계획대로는 못했지만,, 책에 30일플랜으로 나뉘어 있어서 이대로 해도 좋을거같아요', 4, 29, 33),
('2022.08.22', '해설이 빈약함 ㅎㅎ', 3, 30, 33) 
;

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.20', '믿고사는 수제비 일단 23년합격 기원 아멘', 4, 1, 37),
('2022.12.13', '초보자도 쉽게 공부할 수 있도록 체계적으로', 4, 2, 37),
('2022.12.12', '저는 비전공자인데, 수제비 선생님들이 직접 찍은 인강 (워너에듀) 과 함께 공부하니까 너무 좋은거 같고, 네이버 카페 수제비가 너무 잘되어있어요. 공부하기 너무 편해요.', 4, 3, 37),
('2022.12.05', '2023 수제비 정보처리기사 필기 책 정말 보고 완벽한 바이블 인것 같습니다.!!!!', 4, 4, 37),
('2022.12.05', '23년도 정보처리기사 준비를 위해 수제비를 선택했습니다. 비전공자들도 이해하기 쉽게 편찬된 내용과 수험을 위한 암기법(두음), 수제비 책의 특징인 기출문제 정리까지! 마지막으로 해당 저자 직강의 인강이 준비되어 있어, 정보처리기사 준비에 매우 도움이 됩니다. 23년도 1차 정보처리기사 준비는 수제비와 함께!', 4, 5, 37),
('2022.12.04', '비전공자에게 최고인 정보처리기사책 수제비!!
2023년 새롭게 도전하면서 공부해나가겠습니다.', 4, 6, 37),
('2022.11.29', '정보처리기사는 수제비!!', 4, 7, 37),
('2022.11.25', '한번에 합격 하도록 하겠습니다.', 4, 8, 37);

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.04', '컴퓨터과학에 문외한 사람에게 추천합니다. 내용이 어렵지 않고 구성이 알차서 쑥쑥 읽히는 책입니다.', 4, 1, 39),
('2022.11.07', '초보자에게 추천하는책, 면접 준비용으론 어려움', 4, 2, 39),
('2022.12.15', '혼공시리즈는 항상 만족감을 주는 것 같습니다.', 2, 3, 39),
('2022.12.05', '유용하게 잘 읽었습니다.', 4, 4, 39),
('2022.12.05', '유용하게 잘 읽었습니다.', 4, 5, 39),
('2022.11.09', '혼자 공부하는 책 시리즈 좋아요', 4, 6, 39),
('2022.11.07', '많은 도움을 주는 책입니다.', 4, 7, 39),
('2022.10.08', '어럽지 않아서 좋습니다', 4, 8, 39),
('2022.09.12', '각 장마다 마무리 페이지로, 용어정리와 함께 확인 문제로 습득여부를 시험해볼 수 있도록 하고 있었고, 별책으로 용어 노트를 제공해 주고 있었다. 중간중간에 있는 ‘여기서 잠깐’ 박스도 매우 유용하다.아직은 100% 모두 다 내 것이 되지는 않았지만, 여기저기 열어보면서 필요할 때마다 도움 받고 싶은 교재이다. 강추하고픈 컴퓨터관련 기초다지기 혼공교재이다.', 4, 9, 39),
('2022.09.11', '컴퓨터 구조와 운영체제에 대해 알아가고 싶은 비전공자와, 수업을 들었더라도 잘 기억이 나지 않아 복습의 필요성을 느끼는 전공자에게 강력히 추천합니다.', 4, 10, 39),
('2022.12.04', '드문드문 정리되지 않은 컴퓨터에 관한 내용을 쉽게 싹 정리할 수 있어서 좋습니다', 4, 11, 39),
('2022.11.07', '벌써 네 번째 읽어보는 혼공 시리즈 책입니다. 이번에는 컴퓨터 구조와 운영체제를 주제로 나왔네요. 저는 솔직히 혼공 시리즈가 너무 쉽다는 이유로 별로 좋아하지 않았습니다. 전공자 입장에서는 더 세부적인 걸 원하게 되는 것 같습니다. 그러나 몇몇 다양한 책을 읽어보니 혼공 시리즈만큼 읽기 편한 책이 없었습니다. 이제는 비전공자 또는 막 공부하기 시작하는 전공생에게 너무 도움이 되는 시리즈라고 느끼고 있습니다.혼자 공부하게 되면 자신이 공부한 지식이 제대로 머리에 남았는지 알기 쉽지 않습니다. 그렇기에 공부한 후에 지식을 점검하는 것은 꼭 필수라 생각합니다. 이 책은 각 장의 마지막에 마무리로 정리를 다시 해주고, 확인 문제를 통해 제대로 공부했는지 점검할 수 있게 해줍니다. 이게 혼공 시리즈의 장점이라 생각합니다.컴퓨터 구조와 운영체제 수업을 선행 학습해보고 싶은 2학년 전공생에게 추천합니다. 제가 컴퓨터구조, 운영체제 수업을 들을 때 이 책이 왜 없었는지 아쉽기만 합니다. 그때로 돌아간다면 수업보다 이 책으로 먼저 공부를 시작했을 것입니다.', 4, 12, 39),
('2022.12.15', '”혼자 공부하는~” 시리즈의 다른 책 처럼 스스로 학습할 수 있도록 잘 다듬어진 책 한권을 끝내면 내 자신이 더 크게 얻을 수 있는 지식의 깨달음을 경험할 수 있도록 잘 안내하고 있어서 ICT를 전공하고 특별히 운영체제나 컴퓨터 구조에 대해 길을 묻는 후배들에게 좋은 길잡이가 될 것이며, 마지막 페이지를 덮을 때쯤이면 스스로 나 자신이 많이 성장해 있음에 대견해 할 것이다.', 4, 13, 39),
('2022.08.30', '혼자서 공부하기에 친절한 책입니다. 만족합니다.', 4, 14, 39),
('2022.09.11', '역시 믿고 보는 혼공 시리즈다. 컴퓨터 구조와 운영체제를 한 권으로 콤팩트하게 다룬 책이라니..컴퓨터과학과 학생이 왜 컴퓨터의 하드웨어 구조를 알아야 하는지부터 시작해서 명령어의 동작 방식을 설명하고, 자연스럽게 운영체제 개념으로 넘어간다. 운영체제가 무엇인지와 프로세스와 스레드가 무엇인지를 소개한 후, 대용량의 연산을 효율적으로 수행하기 위한 멀티 스레딩, 멀티 프로세싱을 설명한다.여기에 추가로 가상 메모리와 파일 시스템까지 설명하는 알찬 책이다.어쩌다보니 코스가 꼬여 아직 컴퓨터 구조, 운영체제 수업을 듣지 못했는데, 수강 전에 개념 다잡기용으로 큰 도움이 될 것으로 기대한다. 아직 컴구, OS를 듣지 못한 (또는 들었으나 기억에 남는 것이 없는) 모든 컴퓨터관련학과 학생들에게 추천한다. 물론 비전공자에게도 정말 친절한 선생님이 되어준다.', 4, 15, 39),
('2022.09.11', '역시 믿고 보는 혼공 시리즈다. 컴퓨터 구조와 운영체제를 한 권으로 콤팩트하게 다룬 책이라니..컴퓨터과학과 학생이 왜 컴퓨터의 하드웨어 구조를 알아야 하는지부터 시작해서 명령어의 동작 방식을 설명하고, 자연스럽게 운영체제 개념으로 넘어간다. 운영체제가 무엇인지와 프로세스와 스레드가 무엇인지를 소개한 후, 대용량의 연산을 효율적으로 수행하기 위한 멀티 스레딩, 멀티 프로세싱을 설명한다.여기에 추가로 가상 메모리와 파일 시스템까지 설명하는 알찬 책이다.어쩌다보니 코스가 꼬여 아직 컴퓨터 구조, 운영체제 수업을 듣지 못했는데, 수강 전에 개념 다잡기용으로 큰 도움이 될 것으로 기대한다.아직 컴구, OS를 듣지 못한 (또는 들었으나 기억에 남는 것이 없는) 모든 컴퓨터관련학과 학생들에게 추천한다. 물론 비전공자에게도 정말 친절한 선생님이 되어준다.', 4, 16, 39),
('2022.09.04', '가려웠던 부분을 긁어주는 느낌. 내가 무엇을 모르는지 감이 안잡히는 대학교를 막 졸업한 사람들에게 추천해주고싶다. 물론, 이론적인 내용을 다시 짚어보고싶은 이직 준비자에게도 추천해주고 싶다.', 4, 17, 39),
('2022.09.04', '컴퓨터구조, 운영체제 공부', 4, 18, 39)
;
INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.12', '잘 받았습니다 고맙습니다', 4, 1, 42),
('2022.11.23', '자격증 공부 해 보려고 해요', 4, 2, 42),
('2022.11.19', '수험생 시험치고 자격증 도전', 4, 3, 42),
('2022.11.19', '수험생 시험끝나고 자격증 도전해 봅니다', 4, 4, 42),
('2022.11.14', '홈페이지도 잘 되어 있어서. 컴활 준비하고 있다면 꼭 추천해요', 4, 5, 42),
('2022.11.13', '책이 분권되고 교재내용도 중요도에 따라 등급이 나누어져있어 바쁘면 중요한것만이라도 볼 수 있게 구성되어져 너무 좋았어요.', 4, 6, 42),
('2022.10.13', '시나공 브랜드는 언제나 컴퓨터 도서 분야에서 믿고 공부할 수 있는 브랜드입니다', 4, 7, 42),
('2022.08.27', '믿고 보는 시나공!', 4, 8, 42)
;

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.04', '아직 안 봐봤지만 도움 됐으면 좋겠습니다', 2, 1, 43),
('2022.12.03', '유튜브로 강의들을 수 있어서 좋았너요', 4, 2, 43),
('2022.09.22', '늦게라도 공부를 시작하려 구매했는데 좋아요!', 4, 3, 43),
('2022.09.22', '늦게라도 자격증을 따볼까 싶어 구매했는데 내용이 정말 알차네요 ㅎ', 4, 4, 43)
;

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.19', '이해하기 쉬운 설명', 4, 1, 49),
('2022.12.15', '매우 유익한 책이었습니다.', 4, 2, 49),
('2022.12.14', '어려운 내용이 쉽게 되어있네용!!', 4, 3, 49),
('2022.12.13', '매우 도움 됩니다. 추천', 4, 4, 49),
('2022.12.08', '생각보다 그렇게 많이 도움되지는 않아요. 광고빨인듯', 4, 5, 49),
('2022.12.06', '회사 입사후 엑셀이 버거웠는데 많은 도움이되었습니다. 사실 책 제목이 너무 마음에 와닫아서 샀는데 정말 회사에서 엑셀 쓰시는 분들의 필독서로 추천합니다.', 4, 6, 49),
('2022.11.25', '이해가 쉽고 좋네요', 4, 7, 49),
('2022.11.23', 'VLOOKUP 함수를 이 책 보고 비로소 완벽히 이해했네요.', 4, 8, 49),
('2022.11.17', '6년전 저희 회사 임직원분들 강의때부터 뵈었었는데, 책도 보니 너무 쉽고 이해가 잘되게 잘쓰셨군요. 항상 감사합니다!', 4, 9, 49),
('2022.11.16', '만족합니다. 그렇게 도윰되는지는 잘.', 4, 10, 49),
('2022.09.22', '엑셀 급하게 배워야되서 이책 샀어요! 표지부터 쏙쏙 눈에들어오고 내용도 쉽게 설명되있어서 이해하기 편하네요. 저같은 엑셀 왕초보자 한테는 진짜 큰 도움됩니다!', 4, 11, 49),
('2022.11.15', '제발 다 읽지도 못하는 엑셀 책들 말고 이거 보고 시간도 돈도 단축하세요!', 4, 12, 49),
('2022.11.10', '엑셀이 쉽게 이해되고 활용하는데 많은 도움이 됐습니다!', 4, 13, 49),
('2022.11.05', '5일동안 한 번 돌렸습니다. 일의 생산성과 효율성을 높여보겠습니다!', 4, 14, 49),
('2022.11.01', '회사는 엑셀을 가르쳐주지 않기에', 4, 15, 49),
('2022.09.27', '1~2day class!! perfect!!!탈잉vod 수강자로서 강추합니다. 초보자, 엑셀에 자신이 없는 분에게 추천합니다.엑셀에 자신이 없어 등에서 식은땀을 흘렸던 때가 생각나네요!쉽게~ 편하게~ 설명되어 더이상 참고서가 필요없어요. 초보자라도 1~2일이면 완독이 가능해요.', 4, 16, 49);

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.18', '이쪽에 대해 정말 하나도 모르는 사람도 책을 쫓아가다보면 어느새 상품을 등록하고 있는 본인 모습을 보게 될 것 같습니다.', 4, 1, 51),
('2022.12.17', '스마트 스토어 운영에 관심이 생겨 구입했는데 이 책 한 권으로 핵심은 물론 세세한 정보까지 모두 얻을 수 있었습니다. 정말 추천합니다~', 4, 2, 51),
('2022.12.17', '초보가 읽기에 정리가 잘되어있고 쉽게 읽힙니다.', 4, 3, 51),
('2022.12.16', '아직 다 읽진 못했지만 가독성 좋은 구성으로 잘 읽혀요', 4, 4, 51),
('2022.12.16', '현금흐름의 중요성을 알게되었고 그 방법중에 온라인셀러가 되면 좋겠다는 생각으로 책을 구매했습니다. 책이 두께만큼 설명도 너무 자세히 되어있고, 네이버카페도 있어서 가입했습니다.', 4, 5, 51),
('2022.12.14', '지인추천으로 구매해서 책내용대로 실습중이에요. 어려운절차도 쉽게 기재되어있어 교과서처럼 잘 배우고있습니다. 좋은정보 감사합니다^^', 4, 6, 51),
('2022.12.13', '하나씩 그냥 따라하기만해도 된다는 글을 보고 구매하였습니다', 4, 7, 51),
('2022.12.13', '구성 괜찮네요~', 4, 8, 51),
('2022.12.12', '스마트 스토어를 시작하고 싶은데 막막해서 찾아보다 구매했습니다.', 4, 9, 51),
('2022.12.09', '초보자도 따라하기 쉽게 모든 과정이 캡쳐 된 화면으로 구성되어있어요. 막막했던 사업자 등록부터 마켓 개설, 도매사이트 이용방법, 상위노출, CS까지 모든 과정이 책에 들어있어요. 바로 적용할 수 있는 지침서입니다.', 4, 10, 51),
('2022.12.07', '쉽게 따라할 수 있고 자세하게 나와있어서 좋아요 강추합니다!!', 4, 11, 51),
('2022.12.06', '스마트스토어의 기초도 몰랐던 제가 사업자를 내고 한걸음 한걸음 시작할 수 있도록 자세한 설명과 용기를 주는 책입니다.', 4, 12, 51),
('2022.12.05', '어렵게 느껴지기도 하지만 처음은 항상 어려운 법이니 힘을 내어 봅니다.', 4, 13, 51),
('2022.12.04', '따라서 열심히 해보겠습니다.^^', 4, 14, 51),
('2022.12.04', '스마트스토어를 이제막 공부하는데 많은 도움이 되고있어요~ 두꺼운게 그만큼 내용이 너무 알차요!!^ㅡ^', 4, 15, 51),
('2022.12.04', '스마트스토어를 시작하는분들에게 강추합니다~ 책이 두꺼운데 그만큼 도움되는 양질의 글들이 많아요!^ㅡ^ 작가님처럼 열심히 해서 성공적인 스토어가 되도록 할꺼에요>< 화이팅!!', 4, 16, 51),
('2022.12.02', '완전 집중되고 처음으로 무언가 열심히 해보고싶은 욕구가 생겼어요 뭘 해야할지 막막했는데 이 책 읽고 한결 나아졌고 벌써 강의 들어볼 생각에 설레요', 4, 17, 51),
('2022.11.30', '하루에 꾸준히 해보겠습니다', 4, 18, 51),
('2022.11.26', '우선 다 읽어 봐야겠지만, 이 책을 통해서 셀럽의 기초 기반을 잘 만들었으면 하네요.', 4, 19, 51),
('2022.11.26', '아직 앞부분리지만 쉽게 정리 되어 있는 거같습니다~', 4, 20, 51),
('2022.11.25', '유용한 정보를 얻을것같습니다', 4, 21, 51),
('2022.11.25', '아무것도 모르는 상태에서 이 책하나로 스마트 스토어 만들고 상품등록하고 모든걸 할수 있어서 좋았어요.', 4, 22, 51),
('2022.11.23', '스마트스토어 관련 리뷰수가 가장 많아서 구입했습니다..다른 책들은 스토어 개설까지를 너무 디테일하게 다루는 바람에 정작 중요한 스토어 관리 부분은 너무 대충 넘어가는 반면에 이책은 가입부터 관리까지 체계적으로 정리를 해서 좋았습니다..', 4, 23, 51),
('2022.11.22', '내용이 좋고 확실한 책이라 바로 고민없이 샀습니다', 4, 24, 51),
('2022.11.22', '몇 달 전부터 막연하게 스스를 하고 싶다는 생각 뿐이었는데 이 책 하나로 바로 실행에 옮길 수 있었습니다!', 4, 25, 51),
('2022.11.21', '관심을 가지고 시작해보고 싶은 마음에 구입했습니다', 4, 26, 51),
('2022.11.17', '초보자에게 아주 친절한 책입니다. 강추합니다.', 4, 27, 51),
('2022.11.16', '책이 설명이 잘 되어 있어서 이해하기 쉬웠어요! 스마트스토어 처음 시작하시는 분들이 읽기 좋은 책 같아요!', 4, 28, 51),
('2022.11.12', '너무 좋아요 온라인 강의를 비싸게 여러군데서 구매하였는데 강의내용들이 와닿지않아 결국에는 도서를 구매하게 되였어요. 너무 알차게 꽉찬 내용에 감탄했습니다. 가성비템입니다. 강추입니다!', 4, 29, 51),
('2022.11.12', '여러군데 온라인강의를 비싸게 구매하였으나 제대로된 내용이 없어서 결국에는 도서를 구매하게 되였습니다. 너무 저렴한가격에 가성비템입니다 강추!!!', 4, 30, 51) 
;

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.20', '좋은책이에요. 도움이많이되요', 4, 1, 54),
('2022.12.19', '필기랑 병행하려고 샀는데 어려워보이는데 차근차근하면 쉬워요~^^', 4, 2, 54),
('2022.12.12', '잘 받았습니다 고맙습니다', 4, 3, 54),
('2022.12.11', '역시 믿고사는 시나공입니다 ㅎㅎ', 4, 4, 54),
('2022.11.23', '2급을 시나공으로 준비했는데 아주 만족해서 1급도 시나공 선택했습니다.', 4, 5, 54),
('2022.10.23', '/집중돼요', 4, 6, 54),
('2022.09.11', '제발 합격하고 싶어요 제발~~~~~', 4, 7, 54),
('2022.08.18', '1트 합격 가즈아!~', 4, 8, 54),
('2022.08.03', '시나공 컴활 자격증 책은 정석이죠!', 4, 9, 54),
('2022.07.26', '시험합격하겠습니다 굿굿', 4, 10, 54) 
;

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.20', 'it지식을 쌓는데 도움돼요', 4, 1, 56),
('2022.12.19', '도서관에서 대출 해 봤는데 눈에 쉽게 들어오지 않아서 구매했어요', 4, 2, 56),
('2022.12.06', '꾸준히 보기에 좋습니다~', 4, 3, 56),
('2022.12.05', '잘 받았고 잘 읽어보겠습니다', 4, 4, 56),
('2022.12.04', 'c programming language 공동 저자가 쓴 책입니다. 오랜 기간 강의 해 온 경험이 녹아든 책입니다.', 4, 5, 56),
('2022.11.14', '처음 제목을 보고 그저 그런 사람이 썼을 거라 생각했는데, 저자가 매우 유명한 분입니다. 번역 또한 훌륭합니다. 컴퓨터에 대한 기초가 없거나 더 알고자 하는 모든 분께 도움이 될 책입니다.', 4, 6, 56),
('2022.10.24', 'UI디자이너나 앱 기획자가 보는 용은 아닌것같아요', 4, 7, 56),
('2022.10.09', 'it 지식 관련해서 실무에 큰 도움이 되는 책입니다.', 4, 8, 56),
('2022.09.18', '도움이 많이 되요 마음에 들어요', 4, 9, 56),
('2022.09.13', '읽기 편하고 잘 읽혀요', 4, 10, 56),
('2022.09.12', '기초지식용으로 읽어보려고 구입했어요. 마음에 듭니다.', 4, 11, 56),
('2022.09.03', '초보자가 봐도 단번에 이해가 되는 입문책입니다', 4, 12, 56),
('2022.09.03', 'IT 분야의 다양한 지식을 얻을수 있어요.', 4, 13, 56),
('2022.09.02', 'IT좀 아는 사람 읽고 나서 이 책을 읽었는데 디테일이 남다르네요 두 책을 같이 읽으니 훨씬 도움이 되는 것 같아요', 4, 14, 56),
('2022.08.26', '정말 컴퓨터에 대해서 전반적인 이해도가 쑥쑥 넘 찾고있던책이라 잘 읽고 있습니다.', 4, 15, 56),
('2022.08.25', '내용이 충실해요 읽기 편안합니다.', 4, 16, 56),
('2022.08.24', '관심분야라서 구매했습니다.', 4, 17, 56),
('2022.08.24', '일때문에 컴퓨터를 사용하면서도 자세히 모르는게 답답해서 구매했는데 잘 산것 같아 넘 좋아요', 4, 18, 56),
('2022.08.13', '종이책구매자ho***|2022.07.07|신고', 4, 19, 56),
('2022.07.07', 'ㅇㄹㅇㄹㅇㄹㅇㄹㄴㅁㄹㅇㄹ', 3, 20, 56),
('2022.04.26', '제목만 봐서는 IT문외한을 위한 교양서 처럼 보이는데, 실제 내용은 꽤 깊이가 있다. IT의 역사적 측면에서도 꽤 잘 나온다. 전공자지만 몰랐던 내용도 꽤 있다.그리고 어려운 IT 내용을 역사와 더불어 상세히 쉽게 설명해서 전공자나 전공자가 아니라도 모두 볼수 있는 좋은 책인것 같다.', 4, 21, 56),
('2022.06.27', 'IT지식이 없는 일반인이 읽기에 다소 부담스러운 두께에 지루한 내용이라 잘 안 읽혔는데 인내심 갖고 차례대로 말고 흥미 있는 분야 위주로 보니 괜찮네요', 4, 22, 56),
('2022.06.17', '서점에서 보고 구입했어요. 전공자인데도 잼있어용.. 어릴 때 배웠던 피상적이고 비유 위주의 컴퓨터 지식과는 다르게 의외로 직설적인(?)내용입니다', 4, 23, 56),
('2022.06.06', '정리가 잘 되어 도움이 많이 됩니다', 4, 24, 56),
('2022.06.03', '나름 두껍지만 종이질 덕에 책이 가벼워서 좋습니다.', 4, 25, 56),
('2022.05.27', '관련 지식의 향상에 많은 도움이 되었습니다', 4, 26, 56),
('2022.05.15', '회사 업무하는데 많은 도움이 될것 같습니다.', 4, 27, 56),
('2022.05.15', '부담없이 읽기 좋아요', 4, 28, 56),
('2022.05.15', '부담없이 읽기 좋아요', 4, 29, 56),
('2022.04.30', '가독성이 그렇게 좋은 편은 아닌 것 같다.', 4, 30, 56) 
;

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.16', '현대적이 소프트웨어 엔지니어링을 접할 수 있어 좋습니다', 4, 1, 60),
('2022.12.16', '구글에서 사용하는 소프트웨어 엔지니어링이 궁금해서 구매했습니다', 4, 2, 60),
('2022.11.26', '많은 도움이 되는 도서이며, 배송은 말할것도 없이 깔끔하고 빠르게 진행되었습니다. 포인트 등 교보문고에서 구입하는 만족감이 큽니다.', 4, 3, 60),
('2022.11.18', '아직 다 읽어보진 않았지만 도움이 됩니다', 4, 4, 60),
('2022.11.18', '유용하고 쉽게 잘 읽혀요.', 4, 5, 60),
('2022.11.07', '좋아요좋아요좋아요좋아요', 4, 6, 60),
('2022.11.07', '유용하고 좋은 책입니다 참고하기 좋습니다', 4, 7, 60),
('2022.08.29', '책 내용 구성이 좋습니다.', 4, 9, 60),
('2022.08.29', '책 내용 구성이 좋습니다.', 4, 10, 60),
('2022.08.25', '내용이 충실해요 읽기 편안합니다.', 4, 11, 60),
('2022.08.16', '저동네는 어떻게 일하나 엿보기', 4, 12, 60),
('2022.07.28', '개발자라면 꼭 읽어보고싶은 책', 4, 13, 60),
('2022.07.01', '까먹고 있었는데 책이 안왔습니다. 주문일자는2일입니다.', 4, 14, 60),
('2022.06.24', '역시 유명한 책은 다르네요!!', 4, 15, 60),
('2022.06.16', '구글의 개발자들의 일하는 방식을 배울수 있는 유용한 정보가 가득합니다.', 4, 16, 60),
('2022.05.15', '읽으면서 너무 공감하는 내용이 많습니다. 모든 팀원에게 추천하고 싶습니다.', 4, 8, 60),
('2022.05.15', '개발직군에게는 필수 , 비개발 직군도 강력 추천 도서.', 4, 17, 60),
('2022.05.17', '성장하는 엔지니어링 조직이 될것 같습니다', 4, 18, 60),
('2022.05.25', '스타트업 개발자, 중니어 개발자라면 무조건 읽어라. 사수가 생긴다.', 4, 19, 60),
('2022.05.25', '조직 문화, 운영에 큰 도움이 됩니다', 4, 20, 60),
('2022.05.17', '애매하지만 뭔가 손에 잡힐듯 한 소프트웨어 엔지니어링 개념을 잡아줄 좋은 가이드가 되어줄 것입니다.', 4, 21, 60)
;

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.19', '입문하기 좋고 설명도 잘 되어있어요', 4, 1, 64),
('2022.12.18', '쉽게 설명되어있어 도움됩니다', 4, 2, 64),
('2022.12.08', '빅데이터분석에 도움될까 싶어 구매합니다', 4, 3, 64),
('2022.11.29', '공부하기 좋은 것 같습니다.', 4, 4, 64),
('2022.11.18', '잘 읽어보겠습니다. 기대되네요 어떤 내용인지', 4, 5, 64),
('2022.10.26', '유용하고 도움이 됩니다.', 4, 6, 64),
('2022.08.24', '머신러닝 알고리즘의 기본기부터 딥러닝 모델 별로 적용될 수 있는 사례들을 알려주어 파이썬 프로그래밍으로 머신러닝/딥러닝과 친숙해지고자하는 초보자들도 쉽게 접근 가능한 책입니다. 다만, 파이썬 자료구조와 라이브러리에 대한 기본기는 좀 필요할 것 같습니다^^', 4, 7, 64),
('2022.07.29', '추천받아서 샀는데 엄청 꼼꼼해서 초보자도 이해할 수 있고 좋아요', 4, 8, 64),
('2022.07.20', '완전 초짜가 읽기엔 무리가 있어 반드시. 파이썬 입문 서적 학습한 다음에 접근 하시는걸 권장 드려요. 책 내용은 넘 잘돼 있어요.', 4, 9, 64),
('2022.07.15', '혼자 공부하기 좋아요', 4, 10, 64),
('2022.07.07', '실습하지 않고, 읽어보기만 해도 도움이 되었습니다.', 4, 11, 64),
('2022.06.03', '책은 정말 좋은 책 같은데 책 상태가 너무 안좋은거 같아요. 여기저기 찢어져있고 중고 잭같은데 교환 안되나요? 책도 많이 구매했는데 새책으로 다시 보내주셔야되는거 아닐까요?', 4, 12, 64),
('2022.04.05', '책에 자세하게 설명이 되어있어서 이해하는데 쉬워요!', 4, 13, 64),
('2022.03.28', '쉽게 적혀있지만 내용이 적진 않은것 같습니다ㅠ', 4, 14, 64),
('2022.02.28', '선형대수 없이도 이론을 잘 설명해놨습니다 저 같은 초심자에게 매우 좋은듯', 4, 15, 64),
('2022.02.21', '머신러닝에 입문하기에 제일 적당한 책인 것 같습니다. 무료제공되는 강의는 형식적인 강의가 아닌 적재적소에서 모르는 부분을 확실히 잡아 줄 수 있었습니다. 학원이나, 인터넷 강의에서 입문이라고 비싼 돈 주고 강의 듣는 것 보다 이렇게 책으로 공부하는 것이 효과적인 것 같습니다.', 4, 16, 64),
('2022.02.17', '인공지능 학습을 위해 선택했다. 좋은 출발이 기대된다.', 4, 17, 64),
('2021.12.28', '공부하려고 샀어요 좋아요!', 4, 18, 64),
('2021.12.06', '평소 읽고 싶었던 책인데 정독했습니다.', 4, 19, 64),
('2021.11.27', '잘 읽혀요. 빠른 배송 감사합니다.', 4, 20, 64),
('2021.11.20', '틈틈히 공부하려고 책을 구매했습니다. 아직은 시작 단계이지만 기대를 갖고 진행 합니다.', 4, 21, 64),
('2021.11.19', '유익하고 좋아요~만족합니다.', 4, 22, 64),
('2021.11.15', '평소 관심있는 장르로 재미있게 봤습니다.', 4, 23, 64),
('2021.10.17', '가장 쉽게 머신러닝의 기초를 습득할 수 있도록 해 주는 도서다. GOOGLE COLAB, Jupiter Notebook 부터 출발하기에 대단히 쉽게 따라 할 수 있다.', 4, 24, 64),
('2021.10.04', '정말 혼자 공부하기 좋네요. 기대 이상입니다.', 4, 25, 64),
('2021.09.27', '쉽게 설명되어 있어 좋아요', 4, 26, 64),
('2021.09.25', '데이터 분석을 처음 해볼 때 이 책을 읽으면 조아요.', 4, 27, 64),
('2021.09.10', '배우기 쉬운데 예제가 재미없어요 생선분류 럭키백분류 노잼..', 4, 28, 64),
('2021.08.15', '혼자 공부하는데 도움이 많이 됩니다', 4, 29, 64),
('2021.08.09', '빠른 배송 감사합니다~!구성 깔끔하고 개발하는데 많은 도움이 되네요~', 4, 30, 64) 
;

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.15','업무에 도움이 많이 됩니다',4,1,106),
('2022.11.17','막 입사한 주니어들에게 선물해도 좋을 것 같아요 ㅎㅎ',4,2,106),
('2022.11.15','정말 일상, 그리고 회사 생활에서 도움이 되는 유익한 책이였어요 ! 특히 마케팅 관련한 취준생이나 인턴, 직원한테도 권하고 싶은 책이에요. 알찬 구성이라 많이 배우고 정보 얻게 돼서 좋았고 추천합니다 !',4,3,106),
('2022.11.05','사회초년생이나, 기획업무를 시작하시는 분들에게 굉장히 유용할 것 같습니다. 기획서 쓸때마다 턱턱 숨이 막히던 시절은 이제 끝! 다양한 아이디어와 기획안들을 하나의 PPT로 정리하는 방법이 잘 설명되어있어서 좋았어요',4,4,106);

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.11.01','좀 어렵기는 합니다...',4,1,109),
('2022.04.07','탁월한 책입니다',4,5,109),
('2021.02.21','내용이 알차고 좋습니다!',4,2,109),
('2019.11.10','분명 좋은 내용은 맞다 하지만 독자에게 친절한 책은 아니다',2,4,109),
('2018.06.26','좋은 내용입니다.',4,3,109);

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2019.01.30','유용합니다',4,1,112),
('2019.01.30','JSP 리와인드 차 구매를 하게 됐는데 예전에 봤던 책보다 내용이나 질 면에서 읽기도 좋고 좋습니다.',4,2,112),
('2018.09.28','입문자를 위해 친절하게 쓰여진 책',4,3,112),
('2018.08.11','jsp 초보자들의 교과서 같은 책입니다',4,4,112),
('2018.03.13','잘 읽어 볼께요~',4,5,112),
('2017.09.17','그냥 무난합니다',2,6,112),
('2017.06.15','아직 50페이지정도만 읽었지만 입문서적으로 좋네요',4,7,112),
('2017.02.09','강의 해주시는것처럼 이해가 잘 됩니다. 잘 읽고 고급까지 하겠습니다!!',4,8,112),
('2016.09.26','유용한 정보가 많습니다.',4,9,112);

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2019.02.25','2018년 말에 샀는데 번역 진짜 엉망이에요. 변수 이름이 largest 인데 주석에 있는 변수 이름을 한글로 번역해놨네요. 아니 변수 이름을 번역하는 사람이 어딨습니까?',1,1,114),
('2018.04.27','원서로 보세요. 현재 15년 22일 인쇄판의 번역상태가 최악입니다.특히 예문의 *, - 같은 몇몇 연산자나 포인터 표시가 .으로 쓴게 본격적인 본문 시작인 6장에서도 페이지마다 몇개씩 보일 정도로 검수상태가 나쁩니다. 본문의 오역이나 오탈자야 걸러서 볼 수나 있지 코드 예시에서 한두번도 아니고 연속해서 저러고 있으니 생각없이 보다간 이게 뭔가 할 겁니다.',1,2,114),
('2022.11.01','이거야 말로 C++의 정석',4,3,114),
('2020.05.25','기본서로 구입했습니자',4,4,114),
('2019.12.06','필독서 아닌가 해서 구매했어요',4,5,114),
('2019.10.14','씨플의 정석',4,6,114),
('2018.12.25','전설적인 책입니다.',4,7,114),
('2018.09.09','무지 두꺼워요ㅋ',1,8,114),
('2018.03.11','두껍ㅎㅎ',4,9,114),
('2016.02.09','C++ 프로그래머라면 반드시 가지고 있어야 할 도서',4,10,114);

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.12.15','역시 내용이 좋네요',4,1,118),
('2022.11.01','이것 보다 더 정확한 C 기초는 없다',4,2,118),
('2022.04.18','책 좋습니다!!!!!',4,3,118),
('2021.06.17','만약 C에 대해서 깊이 알고자 한다면 이 책은 충분한 가치를 가진다고 생각한다. 반대로 그저 입문용 서적으로만 생각한다면 독자가 생각하는 것 만큼 배우지는 못할것이다.',4,4,118),
('2021.03.05','정말 좋은 책이네요. C입문서로 추천합니다.',4,5,118),
('2021.03.05','정말 좋은 책이네요. C입문서로 추천합니다.',4,6,118),
('2020.08.06','ㅡ번역 좋습니다',4,7,118),
('2020.08.02','좋아요!!',4,8,118),
('2019.12.11','좋아여',4,9,118),
('2019.11.19','오래 되긴 했지만 읽으면 도움이 됩니다.',4,10,118);


INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2019.04.24','C언어에 대하여 다시한번 생각을 할 수 있는 책입니다.',4,11,118),
('2019.04.18','C언어를 깊게 이해하고자 하시는 분들을 위한 책입니다.',4,12,118),
('2019.03.11','C 언어를 공부하고자 한다면 꼭 봐야한다. 하지만 초보자들이 보기엔 어려울 수도 있기 때문에, 처음 프로그래밍을 한다면 권하지 않는다.',4,13,118),
('2018.02.06','C언어 프로그래밍의 바이블',4,14,118),
('2018.01.20','C언어 프로그래밍의 바이블...',4,15,118),
('2017.10.06','C언어 개발자라면 반드시 한번은 봐야할 책',4,16,118);

INSERT INTO kyobo_db.review_info
(ri_date, ri_content, ri_score, ri_mi_seq, ri_bi_seq)
VALUES
('2022.09.02','보기 쉽게 되어있고 재밌게 공부할 수 있는 구성으로 되어있어 좋아요',4,1,121),
('2022.04.01','프로그램 구성이 쉽게 정리되어 프로그램의 이해단계의 분들에게 도움이 되는 책인것 같습니다.',4,2,121),
('2022.01.25','교재 표면 코팅이 벗겨졌네요.',1,3,121),
('2021.09.29','공부해보려고 구매했어요 도움 많이 될듯합니다',4,4,121),
('2020.05.24','흑백 버젼 보단 컬러로 되어 있어서 보기 편하네요',4,5,121),
('2020.05.19','말그대로 랩뷰의 정석임.',4,6,121),
('2020.04.05','랩뷰공부하려 구입햇습니다 감사합니다',4,7,121),
('2020.03.09','교재라 삿어요',2,8,121),
('2019.01.06','랩뷰책중에선 가장 많이 본 책인듯, 설명과 예시가 조화가 잘됨',4,9,121),
('2018.08.27','유용합니다',3,10,121);


SELECT * FRom book_detail_view bdv ;

SELECT  * from book_info bi ;
SELECT  * from review_info ri where ri_bi_seq =118;
SELECT count(*), ai_name from author_info ai group by ai_name;
-- 137 151

SELECT count(*), bi_title  from book_info group by bi_title ;

SELECT * from review_info ri left outer join member_info mi on ri.ri_mi_seq = mi.mi_seq 
where mi.mi_id is null
union
SELECT * from review_info ri right outer join member_info mi on ri.ri_mi_seq = mi.mi_seq 
where mi.mi_id is null;

-- UPDATE review_info set ri_mi_seq = 31 where ri_mi_seq=0;

